app/controllers/bikes_controller.rb

INSERT INTO `bikes` (`brand`, `cost`, `bike_id`) VALUES(NULL, NULL, NULL)
---
  def create
    @bike = Bike.new(params[:bike])

    @bike.save